<?php
/**
 * created by zzy
 * date: 2017/12/18 10:48
 */

return [

    'type_list'     => [
        1=>'工单生产',//工序管理员给派单员工发消息 [员工不同操作时改变自己的该消息的状态][2待领取材料1待开工3已开工4已完工]
        2=>'生产派单',//下单人给工序管理员发消息[工序管理员不同操作时改变自己的该消息状态][1需接单2需分配3已分配]',
        3=>'开工生产',//员工开工给工序管理员发消息
        4=>'新材料入库',//仓库管理员收到消息 (新材料入库 跳转材料详情页面)--------------
        5=>'工单领料',//工单流水出库 (领取材料 跳工单详情(查看领取的材料) )--------------
        6=>'工单退料',//工单流水入库 (材料回退 跳工单详情)--------------,
        7=>'工单创建',//无
        8=>'新材料需求',//给仓管员发消息跳材料详情,------------------------
        9=>'工单创建',//下单人派发工单时给有查看权限的人发消息
        10=>'采购需求',//新采购需求(金加)',????????????????????????//
        11=>'工单报表',//工单报表(朱加)',--------------------
        12=>'材料入工单',//员工添加新材料入工单',-----------------
        13=>'工单修改',//----------------------------
        14=>'工序单修改',//-----------------------------
        15=>'工单开工',//员工开工时给下单人发消息
        16=>'客户消息',//客户给下单人消息'-----------------------------
        17=>'跳板',//-----------------------------------------
        18=>'办公申请',//采购申请,发起人给审批人发消息
        19=>'订单价格',//采购过程中,采购,下单人,客户之间发的消息
        20=>'生产派单',//派发工单下单人发送给采购员的消息',
        21=>'结算单/提货单',//发货的时候给客户发消息',
        22=>'实际出库',//发货的时候给销售和下单人发消息',
        23=>'派发工单，材料详情',//派发工单时下单人给采购发消息',
        24=>'验收入库',//采购单入库时仓库给采购发消息
        25=>'验收入库',//采购单入库时仓库给财务发消息
        26=>'采购订单',//工厂采购员发起采购时给供应商发消息',
        27=>'工单采购',//工厂采购员发起采购时给仓库发消息
        28=>'工单采购',//工厂采购员发起采购时给财务发消息
        29=>'工单开票',//下单人生产派单时给财务发消息
        30=>'工单完工',///员工完工时给工序管理员发消息
        31=>'工单完工',///员工完工时给下单人发消息
        32=>'领取材料',//工序管理员领取材料时发送消息给下单人
        33=>'成品入库',//成品入库时入库人给工单中客户对应的销售发消息,目的:通过消息详情可以去生成应收单
        34=>'预发货',//工单创建完成时,下单人给发货员发消息
        35=>'有新消息',//只做展示不做跳转用---主要用于临时情况
        36=>'生成交货单',///交货流程给仓库发消息
        37=>'生成出库单',//生成出库单时仓库给发货发消息
        38=>'生产派单',//下单人生产派单时给发货员发消息
        39=>'工单废料',//提交废料的时候工序管理员给废品员发消息，点击消息跳转到工单废品详情
        41=>'反馈消息',
        42=>'员工成品入库',//员工成品入库，发送给仓管让仓管验收入库。
        43=>'发货员已发货',//发货员发给销售员，让销售员确认发货
        44=>'新的核销单',//客户发起新的核销单
        45=>'新的核销单',//新的核销单逻辑 发起核销
        46=>'派发工单，材料详情',//派发工单时下单人给仓库发消息',
        47=>'成品调库，待出库',//成品调库，待出库
        48=>'成品调库，待发货',//成品调库，待发货
        49=>'调货发货详情',//调货发货详情
        50=>'采购员核实价格',//仓管分批入库，需采购员填写价格
        51=>'样品图消息',
        52=>'销售查看仓库出后的出库单',//销售查看仓库出后的出库单
    ],
    'foreign_type'  => [
        '1'=>'工单', '2'=>'材料', '3'=>'订单', '4'=>'其它'
    ],
    'order_arr'     => [1,2,3,7,9,11,13,14,15,16],
    'product_arr'   => [4,5,6,8,10,12],
];