<?php
/**
 * Created by PhpStorm.
 * User: zhuyujun
 * Date: 2018/6/5
 * Time: 17:07
 */

//(1) 下单人
//① 未派发 4
//② 待接单 1
//③ 待开工 101
//④ 生产中 2
//⑤ 已完工 3
//(2) 接单人（主管）
//① 待接单 1
//② 待派发 2
//③ 待开工 101
//④ 生产中 3
//⑤ 已完工 4
//(3) 接单人（员工）
//① 待领材 2
//② 待开工 1
//③ 生产中 3
//④ 已完工 4

return [
    'customer_order_price_status_list'=>[
        '1' => [
            'txt' => '待报价',
            'color'=>'FFB401',
        ],
        '2' => [
            'txt' => '待核单',
            'color'=>'FFB401',
        ],
        '3' => [
            'txt' => '已核单',
            'color'=>'FFB401',
        ],
        '4' => [
            'txt' => '已报价',
            'color'=>'FFB401',
        ],
        '5' => [
            'txt' => '待核准',
            'color'=>'FFB401',
        ],
        '6' => [
            'txt' => '待核准',
            'color'=>'FFB401',
        ],
        '100' => [
            'txt' =>'已签署',
            'color'=>'FFB401',
        ],
//        '1' => '待确认',
//        '2' => '待报价',
//        '3' => '待销售员确认',
//        '4' => '待客户确认',
//        '5' => '待销售员确认',
//        '6' => '待客户确认',
//        '100' => '已签署',
    ],
    'customer_order_status_list'=>[
        '1' => [
            'txt' =>'已签署',
            'color'=>'FFB401',
        ],
        '2' => [
            'txt' =>'待派单',
            'color'=>'FFB401',
        ],
        '3' => [
            'txt' =>'待生产',
            'color'=>'FFB401',
        ],
        '4' => [
            'txt' =>'生产中',
            'color'=>'FFB401',
        ],
        '5' => [
            'txt' =>'已完工',
            'color'=>'FFB401',
        ],
        '6' => [
            'txt' =>'已发货',
            'color'=>'FFB401',
        ],
        '7' => [
            'txt' =>'已收讫',
            'color'=>'FFB401',
        ],
        '22' => [
            'txt' =>'已暂停',
            'color'=>'DF6E34',
        ],
        '21' => [
            'txt' =>'已终止',
            'color'=>'EA3434',
        ],
        '100' => [
            'txt' =>'待创建',
            'color'=>'FFB401',
        ],
    ],
    'customer_order_edition_fee_type_list'=>[
        '1' => '一次性支付不退',
//        '2' => '满多少要退版费',
        '3' => '免费',
    ],
    'order_material_qr_type'=>[
        '1' => '领取材料',
        '2' => '材料余品',
        '3' => '材料废品',
        '4' => '材料退品',
    ],
    //主工单相关状态
    'order_status_list'=>[
        '1' => [
            'txt' =>'待接单',
            'color'=>'FFB401',
        ],
        '2' => [
            'txt' =>'生产中',
            'color'=>'FE7E57',
        ],
        '3' => [
            'txt' =>'已完成',
            'color'=>'04C9B3',
        ],
        '4' => [
            'txt' =>'待派发',
            'color'=>'04C9B3',
        ],
        '101' => [
            'txt' =>'待开工',
            'color'=>'FFB401',
        ],
        '21' => [
            'txt' =>'已终止',
            'color'=>'FE7E57',
        ],
        '22' => [
            'txt' =>'已暂停',
            'color'=>'FE7E57',
        ],
    ],
    //工序工单相关状态
    'order_process_status_list'=>[
        '1' => [
            'txt' =>'待接单',
            'color'=>'FFB401',
        ],
        '2' => [
            'txt' =>'待分配',
            'color'=>'FFB401',
        ],
        '3' => [
            'txt' =>'生产中',
            'color'=>'FE7E57',
        ],
        '4' => [
            'txt' =>'已完成',
            'color'=>'04C9B3',
        ],
        '101' => [
            'txt' =>'待开工',
            'color'=>'FFB401',
        ],
        '21' => [
            'txt' =>'已终止',
            'color'=>'FE7E57',
        ],
        '22' => [
            'txt' =>'已暂停',
            'color'=>'FE7E57',
        ],
    ],
    //员工工单相关状态
    'order_process_course_status_list'=>[
        '1' => [
            'txt' =>'待开工',
            'color'=>'FFB401',
        ],
        '2' => [
            'txt' =>'待领料',
            'color'=>'FFB401',
        ],
        '3' => [
            'txt' =>'生产中',
            'color'=>'FE7E57',
        ],
        '4' => [
            'txt' =>'已完成',
            'color'=>'04C9B3',
        ],
        '21' => [
            'txt' =>'已终止',
            'color'=>'FE7E57',
        ],
        '22' => [
            'txt' =>'已暂停',
            'color'=>'FE7E57',
        ],
    ],
    //产品订单相关状态
    'chanpin_order_status_list'=>[
        '1' => [
            'txt' =>'待安排',
            'color'=>'FFB401',
        ],
        '2' => [
            'txt' =>'待生产',
            'color'=>'FFB401',
        ],
        '3' => [
            'txt' =>'生产中',
            'color'=>'FFB401',
        ],
        '4' => [
            'txt' =>'已完成',
            'color'=>'FFB401',
        ],
        '5' => [
            'txt' =>'已终止',
            'color'=>'E83535',
        ],
    ],
    ];
